; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v3 ?v2)
             (pred_6 ?v6 ?v11)
             (pred_7 ?v3 ?v11)
             (pred_11 ?v12 ?v3 )
	     (pred_3 ?v3)
             (pred_12 ?v8)
             (pred_1 ?v6)
             (pred_9 ?v11)
             (pred_5 ?v3)
             (pred_10 ?v6)
             (pred_4 ?v3)
             (pred_2 ))



(:action op_3
:parameters (?v9 ?v10 ?v1 ?v5)
:precondition (and (pred_12 ?v9) (pred_12 ?v10) (pred_1 ?v1) (pred_9 ?v5)
          (pred_8 ?v9 ?v10) (pred_6 ?v1 ?v5)
                   (pred_7 ?v10 ?v5) (pred_3 ?v9) 
                   (pred_5 ?v10) (pred_10 ?v1))
:effect (and  (pred_4 ?v10) (not (pred_5 ?v10))))


(:action op_2
:parameters (?v9 ?v13)
:precondition (and (pred_12 ?v9) (pred_12 ?v13)
               (pred_3 ?v9) (pred_8 ?v9 ?v13) (pred_4 ?v13))
:effect (and (pred_3 ?v13) (not (pred_3 ?v9))))

(:action op_4
:parameters (?v9 ?v1)
:precondition (and (pred_12 ?v9) (pred_1 ?v1) 
                  (pred_3 ?v9) (pred_11 ?v1 ?v9) (pred_2 ))
:effect (and (pred_10 ?v1)
   (not (pred_11 ?v1 ?v9)) (not (pred_2 ))))


(:action op_5
:parameters (?v9 ?v4 ?v7)
:precondition (and (pred_12 ?v9) (pred_1 ?v4) (pred_1 ?v7)
                  (pred_3 ?v9) (pred_10 ?v7) (pred_11 ?v4 ?v9))
:effect (and (pred_10 ?v4) (pred_11 ?v7 ?v9)
        (not (pred_10 ?v7)) (not (pred_11 ?v4 ?v9))))

(:action op_1
:parameters (?v9 ?v1)
:precondition (and (pred_12 ?v9) (pred_1 ?v1) 
                  (pred_3 ?v9) (pred_10 ?v1))
:effect (and (pred_2 ) (pred_11 ?v1 ?v9) (not (pred_10 ?v1)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_15 obj_05 obj_01 obj_22 obj_14 obj_09 obj_03 obj_28 obj_30 obj_19 obj_12 obj_13 obj_24 obj_26 obj_02 obj_16 obj_08 obj_11 obj_25 obj_17 obj_04 obj_18 obj_07 obj_29 obj_20
    obj_10 obj_23
    obj_21 obj_06 obj_27
    )

    (:init
       (pred_2)

       (pred_12 obj_15)
       (pred_12 obj_05)
       (pred_12 obj_01)
       (pred_12 obj_22)
       (pred_12 obj_14)
       (pred_12 obj_09)
       (pred_12 obj_03)
       (pred_12 obj_28)
       (pred_12 obj_30)
       (pred_12 obj_19)
       (pred_12 obj_12)
       (pred_12 obj_13)
       (pred_12 obj_24)
       (pred_12 obj_26)
       (pred_12 obj_02)
       (pred_12 obj_16)
       (pred_12 obj_08)
       (pred_12 obj_11)
       (pred_12 obj_25)
       (pred_12 obj_17)
       (pred_12 obj_04)
       (pred_12 obj_18)
       (pred_12 obj_07)
       (pred_12 obj_29)
       (pred_12 obj_20)
       (pred_9 obj_10)
       (pred_9 obj_23)
       (pred_1 obj_21)
       (pred_1 obj_06)
       (pred_1 obj_27)

       (pred_8 obj_15 obj_09)
       (pred_8 obj_15 obj_05)
       (pred_8 obj_05 obj_03)
       (pred_8 obj_05 obj_01)
       (pred_8 obj_05 obj_15)
       (pred_8 obj_01 obj_28)
       (pred_8 obj_01 obj_22)
       (pred_8 obj_01 obj_05)
       (pred_8 obj_22 obj_30)
       (pred_8 obj_22 obj_14)
       (pred_8 obj_22 obj_01)
       (pred_8 obj_14 obj_19)
       (pred_8 obj_14 obj_22)
       (pred_8 obj_09 obj_12)
       (pred_8 obj_09 obj_03)
       (pred_8 obj_09 obj_15)
       (pred_8 obj_03 obj_13)
       (pred_8 obj_03 obj_28)
       (pred_8 obj_03 obj_05)
       (pred_8 obj_03 obj_09)
       (pred_8 obj_28 obj_24)
       (pred_8 obj_28 obj_30)
       (pred_8 obj_28 obj_01)
       (pred_8 obj_28 obj_03)
       (pred_8 obj_30 obj_26)
       (pred_8 obj_30 obj_19)
       (pred_8 obj_30 obj_22)
       (pred_8 obj_30 obj_28)
       (pred_8 obj_19 obj_02)
       (pred_8 obj_19 obj_14)
       (pred_8 obj_19 obj_30)
       (pred_8 obj_12 obj_16)
       (pred_8 obj_12 obj_13)
       (pred_8 obj_12 obj_09)
       (pred_8 obj_13 obj_08)
       (pred_8 obj_13 obj_24)
       (pred_8 obj_13 obj_03)
       (pred_8 obj_13 obj_12)
       (pred_8 obj_24 obj_11)
       (pred_8 obj_24 obj_26)
       (pred_8 obj_24 obj_28)
       (pred_8 obj_24 obj_13)
       (pred_8 obj_26 obj_25)
       (pred_8 obj_26 obj_02)
       (pred_8 obj_26 obj_30)
       (pred_8 obj_26 obj_24)
       (pred_8 obj_02 obj_17)
       (pred_8 obj_02 obj_19)
       (pred_8 obj_02 obj_26)
       (pred_8 obj_16 obj_04)
       (pred_8 obj_16 obj_08)
       (pred_8 obj_16 obj_12)
       (pred_8 obj_08 obj_18)
       (pred_8 obj_08 obj_11)
       (pred_8 obj_08 obj_13)
       (pred_8 obj_08 obj_16)
       (pred_8 obj_11 obj_07)
       (pred_8 obj_11 obj_25)
       (pred_8 obj_11 obj_24)
       (pred_8 obj_11 obj_08)
       (pred_8 obj_25 obj_29)
       (pred_8 obj_25 obj_17)
       (pred_8 obj_25 obj_26)
       (pred_8 obj_25 obj_11)
       (pred_8 obj_17 obj_20)
       (pred_8 obj_17 obj_02)
       (pred_8 obj_17 obj_25)
       (pred_8 obj_04 obj_18)
       (pred_8 obj_04 obj_16)
       (pred_8 obj_18 obj_07)
       (pred_8 obj_18 obj_08)
       (pred_8 obj_18 obj_04)
       (pred_8 obj_07 obj_29)
       (pred_8 obj_07 obj_11)
       (pred_8 obj_07 obj_18)
       (pred_8 obj_29 obj_20)
       (pred_8 obj_29 obj_25)
       (pred_8 obj_29 obj_07)
       (pred_8 obj_20 obj_17)
       (pred_8 obj_20 obj_29)
       (pred_5 obj_12)
       (pred_5 obj_30)
       (pred_5 obj_07)
       (pred_7  obj_12 obj_10)
       (pred_7  obj_30 obj_23)
       (pred_7  obj_07 obj_10)
       (pred_4 obj_15)
       (pred_4 obj_05)
       (pred_4 obj_01)
       (pred_4 obj_22)
       (pred_4 obj_14)
       (pred_4 obj_09)
       (pred_4 obj_03)
       (pred_4 obj_28)
       (pred_4 obj_19)
       (pred_4 obj_13)
       (pred_4 obj_24)
       (pred_4 obj_26)
       (pred_4 obj_02)
       (pred_4 obj_16)
       (pred_4 obj_08)
       (pred_4 obj_11)
       (pred_4 obj_25)
       (pred_4 obj_17)
       (pred_4 obj_04)
       (pred_4 obj_18)
       (pred_4 obj_29)
       (pred_4 obj_20)

       (pred_6  obj_21 obj_10)
       (pred_6  obj_06 obj_23)
       (pred_6  obj_27 obj_23)
       (pred_11 obj_21 obj_11)
       (pred_11 obj_06 obj_20)
       (pred_11 obj_27 obj_05)
       (pred_3 obj_18)
    )

    (:goal (and
       (pred_11 obj_06 obj_28)
    ))
(:constraints
  (always (not (pred_3 obj_17)))
)
)

; plan
1. (op_2 obj_18 obj_08)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_08)
   goals met: 0 of 1
2. (op_2 obj_08 obj_11)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_11)
   goals met: 0 of 1
3. (op_2 obj_11 obj_25)
   deleted: (pred_3 obj_11)
   added: (pred_3 obj_25)
   goals met: 0 of 1
4. (op_2 obj_25 obj_29)
   deleted: (pred_3 obj_25)
   added: (pred_3 obj_29)
   goals met: 0 of 1
5. (op_2 obj_29 obj_20)
   deleted: (pred_3 obj_29)
   added: (pred_3 obj_20)
   goals met: 0 of 1
6. (op_4 obj_20 obj_06)
   deleted: (pred_11 obj_06 obj_20) (pred_2)
   added: (pred_10 obj_06)
   goals met: 0 of 1
7. (op_2 obj_20 obj_29)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_29)
   goals met: 0 of 1
8. (op_2 obj_29 obj_25)
   deleted: (pred_3 obj_29)
   added: (pred_3 obj_25)
   goals met: 0 of 1
9. (op_2 obj_25 obj_26)
   deleted: (pred_3 obj_25)
   added: (pred_3 obj_26)
   goals met: 0 of 1
10. (op_2 obj_26 obj_24)
   deleted: (pred_3 obj_26)
   added: (pred_3 obj_24)
   goals met: 0 of 1
11. (op_2 obj_24 obj_28)
   deleted: (pred_3 obj_24)
   added: (pred_3 obj_28)
   goals met: 0 of 1
12. (op_1 obj_28 obj_06)
   deleted: (pred_10 obj_06)
   added: (pred_2) (pred_11 obj_06 obj_28)
   goals met: 1 of 1
